WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetDuration_Client_Request-1.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetDuration</a:Action>
    <a:MessageID>urn:uuid:7dc4346a-4111-40f0-b5d2-78c67651a3a7</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDuration xmlns="http://tempuri.org/">
      <inTimeSpan>PT1S</inTimeSpan>
    </RetDuration>
  </s:Body>
</s:Envelope>